OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1574.h
extern __at(0x0DB9) __sfr PWM3TMR;

//==============================================================================
//        PWM3TMRL Bits

extern __at(0x0DB9) __sfr PWM3TMRL;

typedef struct
  {
  unsigned PWM3TMRL0            : 1;
  unsigned PWM3TMRL1            : 1;
  unsigned PWM3TMRL2            : 1;
  unsigned PWM3TMRL3            : 1;
  unsigned PWM3TMRL4            : 1;
  unsigned PWM3TMRL5            : 1;
  unsigned PWM3TMRL6            : 1;
  unsigned PWM3TMRL7            : 1;
  } __PWM3TMRLbits_t;

extern __at(0x0DB9) volatile __PWM3TMRLbits_t PWM3TMRLbits;

#define _PWM3TMRL0              0x01
#define _PWM3TMRL1              0x02
#define _PWM3TMRL2              0x04
#define _PWM3TMRL3              0x08
#define _PWM3TMRL4              0x10
#define _PWM3TMRL5              0x20
#define _PWM3TMRL6              0x40
#define _PWM3TMRL7              0x80

//==============================================================================


//==============================================================================
//        PWM3TMRH Bits

extern __at(0x0DBA) __sfr PWM3TMRH;

typedef struct
  {
  unsigned PWM3TMRH0            : 1;
  unsigned PWM3TMRH1            : 1;
  unsigned PWM3TMRH2            : 1;
  unsigned PWM3TMRH3            : 1;
  unsigned PWM3TMRH4            : 1;
  unsigned PWM3TMRH5            : 1;
  unsigned PWM3TMRH6            : 1;
  unsigned PWM3TMRH7            : 1;
  } __PWM3TMRHbits_t;

extern __at(0x0DBA) volatile __PWM3TMRHbits_t PWM3TMRHbits;

#define _PWM3TMRH0              0x01
#define _PWM3TMRH1              0x02
#define _PWM3TMRH2              0x04
#define _PWM3TMRH3              0x08
#define _PWM3TMRH4              0x10
#define _PWM3TMRH5              0x20
#define _PWM3TMRH6              0x40
#define _PWM3TMRH7              0x80

//==============================================================================


//==============================================================================
//        PWM3CON Bits

extern __at(0x0DBB) __sfr PWM3CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM3MODE0          : 1;
    unsigned PWM3MODE1          : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned OE                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned PWM3POL            : 1;
    unsigned PWM3OUT            : 1;
    unsigned PWM3OE             : 1;
    unsigned PWM3EN             : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned MODE               : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PWM3MODE           : 2;
    unsigned                    : 4;
    };
  } __PWM3CONbits_t;

extern __at(0x0DBB) volatile __PWM3CONbits_t PWM3CONbits;

#define _PWM3CON_PWM3MODE0      0x04
#define _PWM3CON_MODE0          0x04
#define _PWM3CON_PWM3MODE1      0x08
#define _PWM3CON_MODE1          0x08
#define _PWM3CON_POL            0x10
#define _PWM3CON_PWM3POL        0x10
#define _PWM3CON_OUT            0x20
#define _PWM3CON_PWM3OUT        0x20
#define _PWM3CON_OE             0x40
#define _PWM3CON_PWM3OE         0x40
#define _PWM3CON_EN             0x80
#define _PWM3CON_PWM3EN         0x80

//==============================================================================


//==============================================================================
//        PWM3INTCON Bits

extern __at(0x0DBC) __sfr PWM3INTCON;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM3PRIE           : 1;
    unsigned PWM3DCIE           : 1;
    unsigned PWM3PHIE           : 1;
    unsigned PWM3OFIE           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM3INTCONbits_t;

extern __at(0x0DBC) volatile __PWM3INTCONbits_t PWM3INTCONbits;

#define _PWM3INTCON_PRIE        0x01
#define _PWM3INTCON_PWM3PRIE    0x01
#define _PWM3INTCON_DCIE        0x02
#define _PWM3INTCON_PWM3DCIE    0x02
#define _PWM3INTCON_PHIE        0x04
#define _PWM3INTCON_PWM3PHIE    0x04
#define _PWM3INTCON_OFIE        0x08
#define _PWM3INTCON_PWM3OFIE    0x08

//==============================================================================


//==============================================================================
//        PWM3INTE Bits

extern __at(0x0DBC) __sfr PWM3INTE;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM3PRIE           : 1;
    unsigned PWM3DCIE           : 1;
    unsigned PWM3PHIE           : 1;
    unsigned PWM3OFIE           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM3INTEbits_t;

extern __at(0x0DBC) volatile __PWM3INTEbits_t PWM3INTEbits;

#define _PWM3INTE_PRIE          0x01
#define _PWM3INTE_PWM3PRIE      0x01
#define _PWM3INTE_DCIE          0x02
#define _PWM3INTE_PWM3DCIE      0x02
#define _PWM3INTE_PHIE          0x04
#define _PWM3INTE_PWM3PHIE      0x04
#define _PWM3INTE_OFIE          0x08
#define _PWM3INTE_PWM3OFIE      0x08

//==============================================================================


//==============================================================================
//        PWM3INTF Bits

