OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1574.h
extern __at(0x0DBD) __sfr PWM3INTF;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM3PRIF           : 1;
    unsigned PWM3DCIF           : 1;
    unsigned PWM3PHIF           : 1;
    unsigned PWM3OFIF           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM3INTFbits_t;

extern __at(0x0DBD) volatile __PWM3INTFbits_t PWM3INTFbits;

#define _PWM3INTF_PRIF          0x01
#define _PWM3INTF_PWM3PRIF      0x01
#define _PWM3INTF_DCIF          0x02
#define _PWM3INTF_PWM3DCIF      0x02
#define _PWM3INTF_PHIF          0x04
#define _PWM3INTF_PWM3PHIF      0x04
#define _PWM3INTF_OFIF          0x08
#define _PWM3INTF_PWM3OFIF      0x08

//==============================================================================


//==============================================================================
//        PWM3INTFLG Bits

extern __at(0x0DBD) __sfr PWM3INTFLG;

typedef union
  {
  struct
    {
    unsigned PRIF               : 1;
    unsigned DCIF               : 1;
    unsigned PHIF               : 1;
    unsigned OFIF               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM3PRIF           : 1;
    unsigned PWM3DCIF           : 1;
    unsigned PWM3PHIF           : 1;
    unsigned PWM3OFIF           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM3INTFLGbits_t;

extern __at(0x0DBD) volatile __PWM3INTFLGbits_t PWM3INTFLGbits;

#define _PWM3INTFLG_PRIF        0x01
#define _PWM3INTFLG_PWM3PRIF    0x01
#define _PWM3INTFLG_DCIF        0x02
#define _PWM3INTFLG_PWM3DCIF    0x02
#define _PWM3INTFLG_PHIF        0x04
#define _PWM3INTFLG_PWM3PHIF    0x04
#define _PWM3INTFLG_OFIF        0x08
#define _PWM3INTFLG_PWM3OFIF    0x08

//==============================================================================


//==============================================================================
//        PWM3CLKCON Bits

extern __at(0x0DBE) __sfr PWM3CLKCON;

typedef union
  {
  struct
    {
    unsigned PWM3CS0            : 1;
    unsigned PWM3CS1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM3PS0            : 1;
    unsigned PWM3PS1            : 1;
    unsigned PWM3PS2            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PS0                : 1;
    unsigned PS1                : 1;
    unsigned PS2                : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM3CS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned CS                 : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PS                 : 3;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned PWM3PS             : 3;
    unsigned                    : 1;
    };
  } __PWM3CLKCONbits_t;

extern __at(0x0DBE) volatile __PWM3CLKCONbits_t PWM3CLKCONbits;

#define _PWM3CLKCON_PWM3CS0     0x01
#define _PWM3CLKCON_CS0         0x01
#define _PWM3CLKCON_PWM3CS1     0x02
#define _PWM3CLKCON_CS1         0x02
#define _PWM3CLKCON_PWM3PS0     0x10
#define _PWM3CLKCON_PS0         0x10
#define _PWM3CLKCON_PWM3PS1     0x20
#define _PWM3CLKCON_PS1         0x20
#define _PWM3CLKCON_PWM3PS2     0x40
#define _PWM3CLKCON_PS2         0x40

//==============================================================================


//==============================================================================
//        PWM3LDCON Bits

extern __at(0x0DBF) __sfr PWM3LDCON;

typedef union
  {
  struct
    {
    unsigned PWM3LDS0           : 1;
    unsigned PWM3LDS1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned LDT                : 1;
    unsigned LDA                : 1;
    };

  struct
    {
    unsigned LDS0               : 1;
    unsigned LDS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM3LDM            : 1;
    unsigned PWM3LD             : 1;
    };

  struct
    {
    unsigned LDS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PWM3LDS            : 2;
    unsigned                    : 6;
    };
  } __PWM3LDCONbits_t;

extern __at(0x0DBF) volatile __PWM3LDCONbits_t PWM3LDCONbits;

#define _PWM3LDCON_PWM3LDS0     0x01
#define _PWM3LDCON_LDS0         0x01
#define _PWM3LDCON_PWM3LDS1     0x02
#define _PWM3LDCON_LDS1         0x02
#define _PWM3LDCON_LDT          0x40
#define _PWM3LDCON_PWM3LDM      0x40
#define _PWM3LDCON_LDA          0x80
#define _PWM3LDCON_PWM3LD       0x80

//==============================================================================


//==============================================================================
//        PWM3OFCON Bits

extern __at(0x0DC0) __sfr PWM3OFCON;

typedef union
  {
  struct
    {
    unsigned PWM3OFS0           : 1;
    unsigned PWM3OFS1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OFO                : 1;
    unsigned PWM3OFM0           : 1;
    unsigned PWM3OFM1           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS0               : 1;
    unsigned OFS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM3OFMC           : 1;
    unsigned OFM0               : 1;
    unsigned OFM1               : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PWM3OFS            : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 5;
    unsigned OFM                : 2;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 5;
    unsigned PWM3OFM            : 2;
    unsigned                    : 1;
    };
  } __PWM3OFCONbits_t;

extern __at(0x0DC0) volatile __PWM3OFCONbits_t PWM3OFCONbits;

#define _PWM3OFCON_PWM3OFS0     0x01
#define _PWM3OFCON_OFS0         0x01
#define _PWM3OFCON_PWM3OFS1     0x02
#define _PWM3OFCON_OFS1         0x02
#define _PWM3OFCON_OFO          0x10
#define _PWM3OFCON_PWM3OFMC     0x10
#define _PWM3OFCON_PWM3OFM0     0x20
#define _PWM3OFCON_OFM0         0x20
#define _PWM3OFCON_PWM3OFM1     0x40
#define _PWM3OFCON_OFM1         0x40

//==============================================================================

extern __at(0x0DC1) __sfr PWM4PH;

//==============================================================================
//        PWM4PHL Bits

